# AddInId Class

---
Identifies an AddIn registered with Revit
SystemObject Autodesk.Revit.DBAddInId
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class AddInId : IDisposable

    Public Class AddInId
    	Implements IDisposable

    public ref class AddInId : IDisposable

    type AddInId =
        class
            interface IDisposable
        end
The AddInId type exposes the following members.
| Name| Description
---|---|---
| AddInId|  creates an AddInId object with a given GUID
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the AddInId
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetAddInName|  name of addin associated with this AddInId Attempts to obtain the name from loaded Third Party AddIns
| GetAddInNameFromDocument|  name of application associated with this ApplicationId First attempts to obtain the name from AddInIds stored in the document. If unsuccessful, attempts to obtain the name from loaded Third Party AddIns.
| GetGUID|  value of the AddInId as a GUID
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace